una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam7se256.h
/* -------- SDRC_MR : (SDRC Offset: 0x0) SDRAM Controller Mode Register -------- */
#define AT91C_SDRC_MODE       ((unsigned int) 0xF <<  0) /* (SDRC) Mode*/
#define 	AT91C_SDRC_MODE_NORMAL_CMD           ((unsigned int) 0x0) /* (SDRC) Normal Mode*/
#define 	AT91C_SDRC_MODE_NOP_CMD              ((unsigned int) 0x1) /* (SDRC) NOP Command*/
#define 	AT91C_SDRC_MODE_PRCGALL_CMD          ((unsigned int) 0x2) /* (SDRC) All Banks Precharge Command*/
#define 	AT91C_SDRC_MODE_LMR_CMD              ((unsigned int) 0x3) /* (SDRC) Load Mode Register Command*/
#define 	AT91C_SDRC_MODE_RFSH_CMD             ((unsigned int) 0x4) /* (SDRC) Refresh Command*/
#define AT91C_SDRC_DBW        ((unsigned int) 0x1 <<  4) /* (SDRC) Data Bus Width*/
#define 	AT91C_SDRC_DBW_32_BITS              ((unsigned int) 0x0 <<  4) /* (SDRC) 32 Bits datas bus*/
#define 	AT91C_SDRC_DBW_16_BITS              ((unsigned int) 0x1 <<  4) /* (SDRC) 16 Bits datas bus*/
/* -------- SDRC_TR : (SDRC Offset: 0x4) SDRC Refresh Timer Register -------- */
#define AT91C_SDRC_COUNT      ((unsigned int) 0xFFF <<  0) /* (SDRC) Refresh Counter*/
/* -------- SDRC_CR : (SDRC Offset: 0x8) SDRAM Configuration Register -------- */
#define AT91C_SDRC_NC         ((unsigned int) 0x3 <<  0) /* (SDRC) Number of Column Bits*/
#define 	AT91C_SDRC_NC_8                    ((unsigned int) 0x0) /* (SDRC) 8 Bits*/
#define 	AT91C_SDRC_NC_9                    ((unsigned int) 0x1) /* (SDRC) 9 Bits*/
#define 	AT91C_SDRC_NC_10                   ((unsigned int) 0x2) /* (SDRC) 10 Bits*/
#define 	AT91C_SDRC_NC_11                   ((unsigned int) 0x3) /* (SDRC) 11 Bits*/
#define AT91C_SDRC_NR         ((unsigned int) 0x3 <<  2) /* (SDRC) Number of Row Bits*/
#define 	AT91C_SDRC_NR_11                   ((unsigned int) 0x0 <<  2) /* (SDRC) 11 Bits*/
#define 	AT91C_SDRC_NR_12                   ((unsigned int) 0x1 <<  2) /* (SDRC) 12 Bits*/
#define 	AT91C_SDRC_NR_13                   ((unsigned int) 0x2 <<  2) /* (SDRC) 13 Bits*/
#define AT91C_SDRC_NB         ((unsigned int) 0x1 <<  4) /* (SDRC) Number of Banks*/
#define 	AT91C_SDRC_NB_2_BANKS              ((unsigned int) 0x0 <<  4) /* (SDRC) 2 banks*/
#define 	AT91C_SDRC_NB_4_BANKS              ((unsigned int) 0x1 <<  4) /* (SDRC) 4 banks*/
#define AT91C_SDRC_CAS        ((unsigned int) 0x3 <<  5) /* (SDRC) CAS Latency*/
#define 	AT91C_SDRC_CAS_2                    ((unsigned int) 0x2 <<  5) /* (SDRC) 2 cycles*/
#define AT91C_SDRC_TWR        ((unsigned int) 0xF <<  7) /* (SDRC) Number of Write Recovery Time Cycles*/
#define AT91C_SDRC_TRC        ((unsigned int) 0xF << 11) /* (SDRC) Number of RAS Cycle Time Cycles*/
#define AT91C_SDRC_TRP        ((unsigned int) 0xF << 15) /* (SDRC) Number of RAS Precharge Time Cycles*/
#define AT91C_SDRC_TRCD       ((unsigned int) 0xF << 19) /* (SDRC) Number of RAS to CAS Delay Cycles*/
#define AT91C_SDRC_TRAS       ((unsigned int) 0xF << 23) /* (SDRC) Number of RAS Active Time Cycles*/
#define AT91C_SDRC_TXSR       ((unsigned int) 0xF << 27) /* (SDRC) Number of Command Recovery Time Cycles*/
/* -------- SDRC_SRR : (SDRC Offset: 0xc) SDRAM Controller Self-refresh Register -------- */
#define AT91C_SDRC_SRCB       ((unsigned int) 0x1 <<  0) /* (SDRC) Self-refresh Command Bit*/
/* -------- SDRC_LPR : (SDRC Offset: 0x10) SDRAM Controller Low-power Register -------- */
#define AT91C_SDRC_LPCB       ((unsigned int) 0x1 <<  0) /* (SDRC) Low-power Command Bit*/
/* -------- SDRC_IER : (SDRC Offset: 0x14) SDRAM Controller Interrupt Enable Register -------- */
#define AT91C_SDRC_RES        ((unsigned int) 0x1 <<  0) /* (SDRC) Refresh Error Status*/
/* -------- SDRC_IDR : (SDRC Offset: 0x18) SDRAM Controller Interrupt Disable Register -------- */
/* -------- SDRC_IMR : (SDRC Offset: 0x1c) SDRAM Controller Interrupt Mask Register -------- */
/* -------- SDRC_ISR : (SDRC Offset: 0x20) SDRAM Controller Interrupt Status Register -------- */
/* -------- IPB_VER : (SDRC Offset: 0x24) SDRAM Controller IP version Register -------- */
#define AT91C_SDRC_VERSION    ((unsigned int) 0xFFF <<  0) /* (SDRC) IP version of the macrocell*/
#define AT91C_SDRC_MFN        ((unsigned int) 0x7 <<  1) /* (SDRC) */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Error Correction Code controller*/
/* ******************************************************************************/
typedef struct _AT91S_ECC {
	AT91_REG	 ECC_CR; 	/*  ECC reset register*/
	AT91_REG	 ECC_MR; 	/*  ECC Page size register*/
	AT91_REG	 ECC_SR; 	/*  ECC Status register*/
	AT91_REG	 ECC_PR; 	/*  ECC Parity register*/
	AT91_REG	 ECC_NPR; 	/*  ECC Parity N register*/
	AT91_REG	 ECC_VR; 	/*  ECC Version register*/
} AT91S_ECC, *AT91PS_ECC;

/* -------- ECC_CR : (ECC Offset: 0x0) ECC reset register -------- */
#define AT91C_ECC_RST         ((unsigned int) 0x1 <<  0) /* (ECC) ECC reset parity*/
/* -------- ECC_MR : (ECC Offset: 0x4) ECC page size register -------- */
#define AT91C_ECC_PAGE_SIZE   ((unsigned int) 0x3 <<  0) /* (ECC) Nand Flash page size*/
/* -------- ECC_SR : (ECC Offset: 0x8) ECC status register -------- */
#define AT91C_ECC_RECERR      ((unsigned int) 0x1 <<  0) /* (ECC) ECC error*/
#define AT91C_ECC_ECCERR      ((unsigned int) 0x1 <<  1) /* (ECC) ECC single error*/
#define AT91C_ECC_MULERR      ((unsigned int) 0x1 <<  2) /* (ECC) ECC_MULERR*/
/* -------- ECC_PR : (ECC Offset: 0xc) ECC parity register -------- */
#define AT91C_ECC_BITADDR     ((unsigned int) 0xF <<  0) /* (ECC) Bit address error*/
#define AT91C_ECC_WORDADDR    ((unsigned int) 0xFFF <<  4) /* (ECC) address of the failing bit*/
/* -------- ECC_NPR : (ECC Offset: 0x10) ECC N parity register -------- */
#define AT91C_ECC_NPARITY     ((unsigned int) 0xFFFF <<  0) /* (ECC) ECC parity N */
/* -------- ECC_VR : (ECC Offset: 0x14) ECC version register -------- */
#define AT91C_ECC_VERSION     ((unsigned int) 0xFFF <<  0) /* (ECC) ECC version number*/
#define AT91C_ECC_MFN         ((unsigned int) 0x7 << 16) /* (ECC) ECC MFN*/

