una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam7se256.h
/* ******************************************************************************/
/*               PIO DEFINITIONS FOR AT91SAM7SE256*/
/* ******************************************************************************/
#define AT91C_PIO_PA0        ((unsigned int) 1 <<  0) /* Pin Controlled by PA0*/
#define AT91C_PA0_PWM0     ((unsigned int) AT91C_PIO_PA0) /*  */
#define AT91C_PA0_A0_NBS0  ((unsigned int) AT91C_PIO_PA0) /*  */
#define AT91C_PIO_PA1        ((unsigned int) 1 <<  1) /* Pin Controlled by PA1*/
#define AT91C_PA1_PWM1     ((unsigned int) AT91C_PIO_PA1) /*  */
#define AT91C_PA1_A1_NBS2  ((unsigned int) AT91C_PIO_PA1) /*  */
#define AT91C_PIO_PA10       ((unsigned int) 1 << 10) /* Pin Controlled by PA10*/
#define AT91C_PA10_DTXD     ((unsigned int) AT91C_PIO_PA10) /*  */
#define AT91C_PA10_A10      ((unsigned int) AT91C_PIO_PA10) /*  */
#define AT91C_PIO_PA11       ((unsigned int) 1 << 11) /* Pin Controlled by PA11*/
#define AT91C_PA11_NPCS0    ((unsigned int) AT91C_PIO_PA11) /*  */
#define AT91C_PA11_A11      ((unsigned int) AT91C_PIO_PA11) /*  */
#define AT91C_PIO_PA12       ((unsigned int) 1 << 12) /* Pin Controlled by PA12*/
#define AT91C_PA12_MISO     ((unsigned int) AT91C_PIO_PA12) /*  */
#define AT91C_PA12_A12      ((unsigned int) AT91C_PIO_PA12) /*  */
#define AT91C_PIO_PA13       ((unsigned int) 1 << 13) /* Pin Controlled by PA13*/
#define AT91C_PA13_MOSI     ((unsigned int) AT91C_PIO_PA13) /*  */
#define AT91C_PA13_A13      ((unsigned int) AT91C_PIO_PA13) /*  */
#define AT91C_PIO_PA14       ((unsigned int) 1 << 14) /* Pin Controlled by PA14*/
#define AT91C_PA14_SPCK     ((unsigned int) AT91C_PIO_PA14) /*  */
#define AT91C_PA14_A14      ((unsigned int) AT91C_PIO_PA14) /*  */
#define AT91C_PIO_PA15       ((unsigned int) 1 << 15) /* Pin Controlled by PA15*/
#define AT91C_PA15_TF       ((unsigned int) AT91C_PIO_PA15) /*  */
#define AT91C_PA15_A15      ((unsigned int) AT91C_PIO_PA15) /*  */
#define AT91C_PIO_PA16       ((unsigned int) 1 << 16) /* Pin Controlled by PA16*/
#define AT91C_PA16_TK       ((unsigned int) AT91C_PIO_PA16) /*  */
#define AT91C_PA16_A16_BA0  ((unsigned int) AT91C_PIO_PA16) /*  */
#define AT91C_PIO_PA17       ((unsigned int) 1 << 17) /* Pin Controlled by PA17*/
#define AT91C_PA17_TD       ((unsigned int) AT91C_PIO_PA17) /*  */
#define AT91C_PA17_A17_BA1  ((unsigned int) AT91C_PIO_PA17) /*  */
#define AT91C_PIO_PA18       ((unsigned int) 1 << 18) /* Pin Controlled by PA18*/
#define AT91C_PA18_RD       ((unsigned int) AT91C_PIO_PA18) /*  */
#define AT91C_PA18_NBS3_CFIOW ((unsigned int) AT91C_PIO_PA18) /*  */
#define AT91C_PIO_PA19       ((unsigned int) 1 << 19) /* Pin Controlled by PA19*/
#define AT91C_PA19_RK       ((unsigned int) AT91C_PIO_PA19) /*  */
#define AT91C_PA19_NCS4_CFCS0 ((unsigned int) AT91C_PIO_PA19) /*  */
#define AT91C_PIO_PA2        ((unsigned int) 1 <<  2) /* Pin Controlled by PA2*/
#define AT91C_PA2_PWM2     ((unsigned int) AT91C_PIO_PA2) /*  */
#define AT91C_PA2_A2       ((unsigned int) AT91C_PIO_PA2) /*  */
#define AT91C_PIO_PA20       ((unsigned int) 1 << 20) /* Pin Controlled by PA20*/
#define AT91C_PA20_RF       ((unsigned int) AT91C_PIO_PA20) /*  */
#define AT91C_PA20_NCS2_CFCS1 ((unsigned int) AT91C_PIO_PA20) /*  */
#define AT91C_PIO_PA21       ((unsigned int) 1 << 21) /* Pin Controlled by PA21*/
#define AT91C_PA21_RXD1     ((unsigned int) AT91C_PIO_PA21) /*  */
#define AT91C_PA21_NCS6_CFCE2 ((unsigned int) AT91C_PIO_PA21) /*  */
#define AT91C_PIO_PA22       ((unsigned int) 1 << 22) /* Pin Controlled by PA22*/
#define AT91C_PA22_TXD1     ((unsigned int) AT91C_PIO_PA22) /*  */
#define AT91C_PA22_NCS5_CFCE1 ((unsigned int) AT91C_PIO_PA22) /*  */
#define AT91C_PIO_PA23       ((unsigned int) 1 << 23) /* Pin Controlled by PA23*/
#define AT91C_PA23_SCK1     ((unsigned int) AT91C_PIO_PA23) /*  */
#define AT91C_PA23_NWR1_NBS1_CFIOR_NUB ((unsigned int) AT91C_PIO_PA23) /*  */
#define AT91C_PIO_PA24       ((unsigned int) 1 << 24) /* Pin Controlled by PA24*/
#define AT91C_PA24_RTS1     ((unsigned int) AT91C_PIO_PA24) /*  */
#define AT91C_PA24_SDA10    ((unsigned int) AT91C_PIO_PA24) /*  */
#define AT91C_PIO_PA25       ((unsigned int) 1 << 25) /* Pin Controlled by PA25*/
#define AT91C_PA25_CTS1     ((unsigned int) AT91C_PIO_PA25) /*  */
#define AT91C_PA25_SDCKE    ((unsigned int) AT91C_PIO_PA25) /*  */
#define AT91C_PIO_PA26       ((unsigned int) 1 << 26) /* Pin Controlled by PA26*/
#define AT91C_PA26_DCD1     ((unsigned int) AT91C_PIO_PA26) /*  */
#define AT91C_PA26_NCS1_SDCS ((unsigned int) AT91C_PIO_PA26) /*  */
#define AT91C_PIO_PA27       ((unsigned int) 1 << 27) /* Pin Controlled by PA27*/
#define AT91C_PA27_DTR1     ((unsigned int) AT91C_PIO_PA27) /*  */
#define AT91C_PA27_SDWE     ((unsigned int) AT91C_PIO_PA27) /*  */
#define AT91C_PIO_PA28       ((unsigned int) 1 << 28) /* Pin Controlled by PA28*/
#define AT91C_PA28_DSR1     ((unsigned int) AT91C_PIO_PA28) /*  */
#define AT91C_PA28_CAS      ((unsigned int) AT91C_PIO_PA28) /*  */
#define AT91C_PIO_PA29       ((unsigned int) 1 << 29) /* Pin Controlled by PA29*/
#define AT91C_PA29_RI1      ((unsigned int) AT91C_PIO_PA29) /*  */
#define AT91C_PA29_RAS      ((unsigned int) AT91C_PIO_PA29) /*  */
#define AT91C_PIO_PA3        ((unsigned int) 1 <<  3) /* Pin Controlled by PA3*/
#define AT91C_PA3_TWD      ((unsigned int) AT91C_PIO_PA3) /*  */
#define AT91C_PA3_A3       ((unsigned int) AT91C_PIO_PA3) /*  */
#define AT91C_PIO_PA30       ((unsigned int) 1 << 30) /* Pin Controlled by PA30*/
#define AT91C_PA30_IRQ1     ((unsigned int) AT91C_PIO_PA30) /*  */
#define AT91C_PA30_D30      ((unsigned int) AT91C_PIO_PA30) /*  */
#define AT91C_PIO_PA31       ((unsigned int) 1 << 31) /* Pin Controlled by PA31*/
#define AT91C_PA31_NPCS1    ((unsigned int) AT91C_PIO_PA31) /*  */
#define AT91C_PA31_D31      ((unsigned int) AT91C_PIO_PA31) /*  */
#define AT91C_PIO_PA4        ((unsigned int) 1 <<  4) /* Pin Controlled by PA4*/
#define AT91C_PA4_TWCK     ((unsigned int) AT91C_PIO_PA4) /*  */
#define AT91C_PA4_A4       ((unsigned int) AT91C_PIO_PA4) /*  */
#define AT91C_PIO_PA5        ((unsigned int) 1 <<  5) /* Pin Controlled by PA5*/
#define AT91C_PA5_RXD0     ((unsigned int) AT91C_PIO_PA5) /*  */
#define AT91C_PA5_A5       ((unsigned int) AT91C_PIO_PA5) /*  */
#define AT91C_PIO_PA6        ((unsigned int) 1 <<  6) /* Pin Controlled by PA6*/
#define AT91C_PA6_TXD0     ((unsigned int) AT91C_PIO_PA6) /*  */
#define AT91C_PA6_A6       ((unsigned int) AT91C_PIO_PA6) /*  */
#define AT91C_PIO_PA7        ((unsigned int) 1 <<  7) /* Pin Controlled by PA7*/
#define AT91C_PA7_RTS0     ((unsigned int) AT91C_PIO_PA7) /*  */
#define AT91C_PA7_A7       ((unsigned int) AT91C_PIO_PA7) /*  */
#define AT91C_PIO_PA8        ((unsigned int) 1 <<  8) /* Pin Controlled by PA8*/
#define AT91C_PA8_CTS0     ((unsigned int) AT91C_PIO_PA8) /*  */
#define AT91C_PA8_A8       ((unsigned int) AT91C_PIO_PA8) /*  */
#define AT91C_PIO_PA9        ((unsigned int) 1 <<  9) /* Pin Controlled by PA9*/
#define AT91C_PA9_DRXD     ((unsigned int) AT91C_PIO_PA9) /*  */
#define AT91C_PA9_A9       ((unsigned int) AT91C_PIO_PA9) /*  */
#define AT91C_PIO_PB0        ((unsigned int) 1 <<  0) /* Pin Controlled by PB0*/
#define AT91C_PB0_TIOA0    ((unsigned int) AT91C_PIO_PB0) /*  */
#define AT91C_PB0_A0_NBS0  ((unsigned int) AT91C_PIO_PB0) /*  */
#define AT91C_PIO_PB1        ((unsigned int) 1 <<  1) /* Pin Controlled by PB1*/
#define AT91C_PB1_TIOB0    ((unsigned int) AT91C_PIO_PB1) /*  */
#define AT91C_PB1_A1_NBS2  ((unsigned int) AT91C_PIO_PB1) /*  */
#define AT91C_PIO_PB10       ((unsigned int) 1 << 10) /* Pin Controlled by PB10*/
#define AT91C_PB10_NPCS2    ((unsigned int) AT91C_PIO_PB10) /*  */
#define AT91C_PB10_A10      ((unsigned int) AT91C_PIO_PB10) /*  */
#define AT91C_PIO_PB11       ((unsigned int) 1 << 11) /* Pin Controlled by PB11*/
#define AT91C_PB11_PWM0     ((unsigned int) AT91C_PIO_PB11) /*  */
#define AT91C_PB11_A11      ((unsigned int) AT91C_PIO_PB11) /*  */
#define AT91C_PIO_PB12       ((unsigned int) 1 << 12) /* Pin Controlled by PB12*/
#define AT91C_PB12_PWM1     ((unsigned int) AT91C_PIO_PB12) /*  */
#define AT91C_PB12_A12      ((unsigned int) AT91C_PIO_PB12) /*  */
#define AT91C_PIO_PB13       ((unsigned int) 1 << 13) /* Pin Controlled by PB13*/
#define AT91C_PB13_PWM2     ((unsigned int) AT91C_PIO_PB13) /*  */
#define AT91C_PB13_A13      ((unsigned int) AT91C_PIO_PB13) /*  */
#define AT91C_PIO_PB14       ((unsigned int) 1 << 14) /* Pin Controlled by PB14*/
#define AT91C_PB14_PWM3     ((unsigned int) AT91C_PIO_PB14) /*  */
#define AT91C_PB14_A14      ((unsigned int) AT91C_PIO_PB14) /*  */
#define AT91C_PIO_PB15       ((unsigned int) 1 << 15) /* Pin Controlled by PB15*/
#define AT91C_PB15_TIOA1    ((unsigned int) AT91C_PIO_PB15) /*  */
#define AT91C_PB15_A15      ((unsigned int) AT91C_PIO_PB15) /*  */
#define AT91C_PIO_PB16       ((unsigned int) 1 << 16) /* Pin Controlled by PB16*/
#define AT91C_PB16_TIOA2    ((unsigned int) AT91C_PIO_PB16) /*  */
#define AT91C_PB16_A16_BA0  ((unsigned int) AT91C_PIO_PB16) /*  */
#define AT91C_PIO_PB17       ((unsigned int) 1 << 17) /* Pin Controlled by PB17*/
#define AT91C_PB17_PCK1     ((unsigned int) AT91C_PIO_PB17) /*  */
#define AT91C_PB17_A17_BA1  ((unsigned int) AT91C_PIO_PB17) /*  */
#define AT91C_PIO_PB18       ((unsigned int) 1 << 18) /* Pin Controlled by PB18*/
#define AT91C_PB18_PCK2     ((unsigned int) AT91C_PIO_PB18) /*  */
#define AT91C_PB18_D16      ((unsigned int) AT91C_PIO_PB18) /*  */
#define AT91C_PIO_PB19       ((unsigned int) 1 << 19) /* Pin Controlled by PB19*/
#define AT91C_PB19_FIQ      ((unsigned int) AT91C_PIO_PB19) /*  */
#define AT91C_PB19_D17      ((unsigned int) AT91C_PIO_PB19) /*  */
#define AT91C_PIO_PB2        ((unsigned int) 1 <<  2) /* Pin Controlled by PB2*/
#define AT91C_PB2_SCK0     ((unsigned int) AT91C_PIO_PB2) /*  */
#define AT91C_PB2_A2       ((unsigned int) AT91C_PIO_PB2) /*  */
#define AT91C_PIO_PB20       ((unsigned int) 1 << 20) /* Pin Controlled by PB20*/
#define AT91C_PB20_IRQ0     ((unsigned int) AT91C_PIO_PB20) /*  */
#define AT91C_PB20_D18      ((unsigned int) AT91C_PIO_PB20) /*  */
#define AT91C_PIO_PB21       ((unsigned int) 1 << 21) /* Pin Controlled by PB21*/
#define AT91C_PB21_PCK1     ((unsigned int) AT91C_PIO_PB21) /*  */
#define AT91C_PB21_D19      ((unsigned int) AT91C_PIO_PB21) /*  */
#define AT91C_PIO_PB22       ((unsigned int) 1 << 22) /* Pin Controlled by PB22*/
#define AT91C_PB22_NPCS3    ((unsigned int) AT91C_PIO_PB22) /*  */
#define AT91C_PB22_D20      ((unsigned int) AT91C_PIO_PB22) /*  */
#define AT91C_PIO_PB23       ((unsigned int) 1 << 23) /* Pin Controlled by PB23*/
#define AT91C_PB23_PWM0     ((unsigned int) AT91C_PIO_PB23) /*  */
#define AT91C_PB23_D21      ((unsigned int) AT91C_PIO_PB23) /*  */
#define AT91C_PIO_PB24       ((unsigned int) 1 << 24) /* Pin Controlled by PB24*/
#define AT91C_PB24_PWM1     ((unsigned int) AT91C_PIO_PB24) /*  */
#define AT91C_PB24_D22      ((unsigned int) AT91C_PIO_PB24) /*  */
#define AT91C_PIO_PB25       ((unsigned int) 1 << 25) /* Pin Controlled by PB25*/
#define AT91C_PB25_PWM2     ((unsigned int) AT91C_PIO_PB25) /*  */
#define AT91C_PB25_D23      ((unsigned int) AT91C_PIO_PB25) /*  */
#define AT91C_PIO_PB26       ((unsigned int) 1 << 26) /* Pin Controlled by PB26*/
#define AT91C_PB26_TIOA2    ((unsigned int) AT91C_PIO_PB26) /*  */
#define AT91C_PB26_D24      ((unsigned int) AT91C_PIO_PB26) /*  */
#define AT91C_PIO_PB27       ((unsigned int) 1 << 27) /* Pin Controlled by PB27*/
#define AT91C_PB27_TIOB2    ((unsigned int) AT91C_PIO_PB27) /*  */
#define AT91C_PB27_D25      ((unsigned int) AT91C_PIO_PB27) /*  */
#define AT91C_PIO_PB28       ((unsigned int) 1 << 28) /* Pin Controlled by PB28*/
#define AT91C_PB28_TCLK1    ((unsigned int) AT91C_PIO_PB28) /*  */
#define AT91C_PB28_D26      ((unsigned int) AT91C_PIO_PB28) /*  */
#define AT91C_PIO_PB29       ((unsigned int) 1 << 29) /* Pin Controlled by PB29*/
#define AT91C_PB29_TCLK2    ((unsigned int) AT91C_PIO_PB29) /*  */
#define AT91C_PB29_D27      ((unsigned int) AT91C_PIO_PB29) /*  */
#define AT91C_PIO_PB3        ((unsigned int) 1 <<  3) /* Pin Controlled by PB3*/
#define AT91C_PB3_NPCS3    ((unsigned int) AT91C_PIO_PB3) /*  */
#define AT91C_PB3_A3       ((unsigned int) AT91C_PIO_PB3) /*  */
#define AT91C_PIO_PB30       ((unsigned int) 1 << 30) /* Pin Controlled by PB30*/
#define AT91C_PB30_NPCS2    ((unsigned int) AT91C_PIO_PB30) /*  */
#define AT91C_PB30_D28      ((unsigned int) AT91C_PIO_PB30) /*  */
#define AT91C_PIO_PB31       ((unsigned int) 1 << 31) /* Pin Controlled by PB31*/
#define AT91C_PB31_PCK2     ((unsigned int) AT91C_PIO_PB31) /*  */
#define AT91C_PB31_D29      ((unsigned int) AT91C_PIO_PB31) /*  */
#define AT91C_PIO_PB4        ((unsigned int) 1 <<  4) /* Pin Controlled by PB4*/
#define AT91C_PB4_TCLK0    ((unsigned int) AT91C_PIO_PB4) /*  */
#define AT91C_PB4_A4       ((unsigned int) AT91C_PIO_PB4) /*  */
#define AT91C_PIO_PB5        ((unsigned int) 1 <<  5) /* Pin Controlled by PB5*/
#define AT91C_PB5_NPCS3    ((unsigned int) AT91C_PIO_PB5) /*  */
#define AT91C_PB5_A5       ((unsigned int) AT91C_PIO_PB5) /*  */
#define AT91C_PIO_PB6        ((unsigned int) 1 <<  6) /* Pin Controlled by PB6*/
#define AT91C_PB6_PCK0     ((unsigned int) AT91C_PIO_PB6) /*  */
#define AT91C_PB6_A6       ((unsigned int) AT91C_PIO_PB6) /*  */
#define AT91C_PIO_PB7        ((unsigned int) 1 <<  7) /* Pin Controlled by PB7*/
#define AT91C_PB7_PWM3     ((unsigned int) AT91C_PIO_PB7) /*  */
#define AT91C_PB7_A7       ((unsigned int) AT91C_PIO_PB7) /*  */
#define AT91C_PIO_PB8        ((unsigned int) 1 <<  8) /* Pin Controlled by PB8*/
#define AT91C_PB8_ADTRG    ((unsigned int) AT91C_PIO_PB8) /*  */
#define AT91C_PB8_A8       ((unsigned int) AT91C_PIO_PB8) /*  */
#define AT91C_PIO_PB9        ((unsigned int) 1 <<  9) /* Pin Controlled by PB9*/
#define AT91C_PB9_NPCS1    ((unsigned int) AT91C_PIO_PB9) /*  */
#define AT91C_PB9_A9       ((unsigned int) AT91C_PIO_PB9) /*  */
#define AT91C_PIO_PC0        ((unsigned int) 1 <<  0) /* Pin Controlled by PC0*/
#define AT91C_PC0_D0       ((unsigned int) AT91C_PIO_PC0) /*  */
#define AT91C_PIO_PC1        ((unsigned int) 1 <<  1) /* Pin Controlled by PC1*/
#define AT91C_PC1_D1       ((unsigned int) AT91C_PIO_PC1) /*  */
#define AT91C_PIO_PC10       ((unsigned int) 1 << 10) /* Pin Controlled by PC10*/
#define AT91C_PC10_D10      ((unsigned int) AT91C_PIO_PC10) /*  */
#define AT91C_PC10_PCK0     ((unsigned int) AT91C_PIO_PC10) /*  */
#define AT91C_PIO_PC11       ((unsigned int) 1 << 11) /* Pin Controlled by PC11*/
#define AT91C_PC11_D11      ((unsigned int) AT91C_PIO_PC11) /*  */
#define AT91C_PC11_PCK1     ((unsigned int) AT91C_PIO_PC11) /*  */
#define AT91C_PIO_PC12       ((unsigned int) 1 << 12) /* Pin Controlled by PC12*/
#define AT91C_PC12_D12      ((unsigned int) AT91C_PIO_PC12) /*  */
#define AT91C_PC12_PCK2     ((unsigned int) AT91C_PIO_PC12) /*  */
#define AT91C_PIO_PC13       ((unsigned int) 1 << 13) /* Pin Controlled by PC13*/
#define AT91C_PC13_D13      ((unsigned int) AT91C_PIO_PC13) /*  */
#define AT91C_PIO_PC14       ((unsigned int) 1 << 14) /* Pin Controlled by PC14*/
#define AT91C_PC14_D14      ((unsigned int) AT91C_PIO_PC14) /*  */
#define AT91C_PC14_NPCS1    ((unsigned int) AT91C_PIO_PC14) /*  */
#define AT91C_PIO_PC15       ((unsigned int) 1 << 15) /* Pin Controlled by PC15*/
#define AT91C_PC15_D15      ((unsigned int) AT91C_PIO_PC15) /*  */
#define AT91C_PC15_NCS3_NANDCS ((unsigned int) AT91C_PIO_PC15) /*  */
#define AT91C_PIO_PC16       ((unsigned int) 1 << 16) /* Pin Controlled by PC16*/
#define AT91C_PC16_A18      ((unsigned int) AT91C_PIO_PC16) /*  */
#define AT91C_PC16_NWAIT    ((unsigned int) AT91C_PIO_PC16) /*  */
#define AT91C_PIO_PC17       ((unsigned int) 1 << 17) /* Pin Controlled by PC17*/
#define AT91C_PC17_A19      ((unsigned int) AT91C_PIO_PC17) /*  */
#define AT91C_PC17_NANDOE   ((unsigned int) AT91C_PIO_PC17) /*  */
#define AT91C_PIO_PC18       ((unsigned int) 1 << 18) /* Pin Controlled by PC18*/
#define AT91C_PC18_A20      ((unsigned int) AT91C_PIO_PC18) /*  */
#define AT91C_PC18_NANDWE   ((unsigned int) AT91C_PIO_PC18) /*  */
#define AT91C_PIO_PC19       ((unsigned int) 1 << 19) /* Pin Controlled by PC19*/
#define AT91C_PC19_A21      ((unsigned int) AT91C_PIO_PC19) /*  */
#define AT91C_PIO_PC2        ((unsigned int) 1 <<  2) /* Pin Controlled by PC2*/
#define AT91C_PC2_D2       ((unsigned int) AT91C_PIO_PC2) /*  */
#define AT91C_PIO_PC20       ((unsigned int) 1 << 20) /* Pin Controlled by PC20*/
#define AT91C_PC20_A22      ((unsigned int) AT91C_PIO_PC20) /*  */
#define AT91C_PC20_NCS7     ((unsigned int) AT91C_PIO_PC20) /*  */
#define AT91C_PIO_PC21       ((unsigned int) 1 << 21) /* Pin Controlled by PC21*/
#define AT91C_PC21_A23      ((unsigned int) AT91C_PIO_PC21) /*  */
#define AT91C_PC21_NWR0_NWE_CFWE ((unsigned int) AT91C_PIO_PC21) /*  */
#define AT91C_PIO_PC22       ((unsigned int) 1 << 22) /* Pin Controlled by PC22*/
#define AT91C_PC22_A24      ((unsigned int) AT91C_PIO_PC22) /*  */
#define AT91C_PC22_NRD_CFOE ((unsigned int) AT91C_PIO_PC22) /*  */
#define AT91C_PIO_PC23       ((unsigned int) 1 << 23) /* Pin Controlled by PC23*/
#define AT91C_PC23_A25_CFRNW ((unsigned int) AT91C_PIO_PC23) /*  */
#define AT91C_PC23_NCS0     ((unsigned int) AT91C_PIO_PC23) /*  */
#define AT91C_PIO_PC3        ((unsigned int) 1 <<  3) /* Pin Controlled by PC3*/
#define AT91C_PC3_D3       ((unsigned int) AT91C_PIO_PC3) /*  */
#define AT91C_PIO_PC4        ((unsigned int) 1 <<  4) /* Pin Controlled by PC4*/
#define AT91C_PC4_D4       ((unsigned int) AT91C_PIO_PC4) /*  */
#define AT91C_PIO_PC5        ((unsigned int) 1 <<  5) /* Pin Controlled by PC5*/
#define AT91C_PC5_D5       ((unsigned int) AT91C_PIO_PC5) /*  */
#define AT91C_PIO_PC6        ((unsigned int) 1 <<  6) /* Pin Controlled by PC6*/
#define AT91C_PC6_D6       ((unsigned int) AT91C_PIO_PC6) /*  */
#define AT91C_PIO_PC7        ((unsigned int) 1 <<  7) /* Pin Controlled by PC7*/
#define AT91C_PC7_D7       ((unsigned int) AT91C_PIO_PC7) /*  */
#define AT91C_PIO_PC8        ((unsigned int) 1 <<  8) /* Pin Controlled by PC8*/
#define AT91C_PC8_D8       ((unsigned int) AT91C_PIO_PC8) /*  */
#define AT91C_PC8_RTS1     ((unsigned int) AT91C_PIO_PC8) /*  */
#define AT91C_PIO_PC9        ((unsigned int) 1 <<  9) /* Pin Controlled by PC9*/
#define AT91C_PC9_D9       ((unsigned int) AT91C_PIO_PC9) /*  */
#define AT91C_PC9_DTR1     ((unsigned int) AT91C_PIO_PC9) /*  */

/* ******************************************************************************/
/*               PERIPHERAL ID DEFINITIONS FOR AT91SAM7SE256*/
/* ******************************************************************************/
#define AT91C_ID_FIQ    ((unsigned int)  0) /* Advanced Interrupt Controller (FIQ)*/
#define AT91C_ID_SYS    ((unsigned int)  1) /* System Peripheral*/
#define AT91C_ID_PIOA   ((unsigned int)  2) /* Parallel IO Controller A*/
#define AT91C_ID_PIOB   ((unsigned int)  3) /* Parallel IO Controller B*/
#define AT91C_ID_PIOC   ((unsigned int)  4) /* Parallel IO Controller C*/
#define AT91C_ID_SPI    ((unsigned int)  5) /* Serial Peripheral Interface 0*/
#define AT91C_ID_US0    ((unsigned int)  6) /* USART 0*/
#define AT91C_ID_US1    ((unsigned int)  7) /* USART 1*/
#define AT91C_ID_SSC    ((unsigned int)  8) /* Serial Synchronous Controller*/
#define AT91C_ID_TWI    ((unsigned int)  9) /* Two-Wire Interface*/
#define AT91C_ID_PWMC   ((unsigned int) 10) /* PWM Controller*/
#define AT91C_ID_UDP    ((unsigned int) 11) /* USB Device Port*/
#define AT91C_ID_TC0    ((unsigned int) 12) /* Timer Counter 0*/
#define AT91C_ID_TC1    ((unsigned int) 13) /* Timer Counter 1*/
#define AT91C_ID_TC2    ((unsigned int) 14) /* Timer Counter 2*/
#define AT91C_ID_ADC    ((unsigned int) 15) /* Analog-to-Digital Converter*/
#define AT91C_ID_16_Reserved ((unsigned int) 16) /* Reserved*/
#define AT91C_ID_17_Reserved ((unsigned int) 17) /* Reserved*/
#define AT91C_ID_18_Reserved ((unsigned int) 18) /* Reserved*/
#define AT91C_ID_19_Reserved ((unsigned int) 19) /* Reserved*/
#define AT91C_ID_20_Reserved ((unsigned int) 20) /* Reserved*/
#define AT91C_ID_21_Reserved ((unsigned int) 21) /* Reserved*/
#define AT91C_ID_22_Reserved ((unsigned int) 22) /* Reserved*/
#define AT91C_ID_23_Reserved ((unsigned int) 23) /* Reserved*/
#define AT91C_ID_24_Reserved ((unsigned int) 24) /* Reserved*/
#define AT91C_ID_25_Reserved ((unsigned int) 25) /* Reserved*/
#define AT91C_ID_26_Reserved ((unsigned int) 26) /* Reserved*/
#define AT91C_ID_27_Reserved ((unsigned int) 27) /* Reserved*/
#define AT91C_ID_28_Reserved ((unsigned int) 28) /* Reserved*/
#define AT91C_ID_IRQ0   ((unsigned int) 29) /* Advanced Interrupt Controller (IRQ0)*/
#define AT91C_ID_IRQ1   ((unsigned int) 30) /* Advanced Interrupt Controller (IRQ1)*/
#define AT91C_ID_31_Reserved ((unsigned int) 31) /* Reserved*/
#define AT91C_ALL_INT   ((unsigned int) 0x6000FFFF) /* ALL VALID INTERRUPTS*/

